apps/gosonos/pkg/sonos/requests/add_tracks.xml.tmpl

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"
    s:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
    <s:Body>
        <u:AddMultipleURIsToQueue xmlns:u="urn:schemas-upnp-org:service:AVTransport:1">
            <InstanceID>0</InstanceID>
            <UpdateID>0</UpdateID>
            <NumberOfURIs>{{.Count}}</NumberOfURIs>
            <EnqueuedURIs>{{.URIs}}</EnqueuedURIs>
            <EnqueuedURIsMetaData>{{.Metadata}}</EnqueuedURIsMetaData>
            <DesiredFirstTrackNumberEnqueued>0</DesiredFirstTrackNumberEnqueued>
            <EnqueueAsNext>0</EnqueueAsNext>
        </u:AddMultipleURIsToQueue>
    </s:Body>
</s:Envelope>
